emacs/bricewge.org
#+TITLE: Brice Waegeneire's Emacs configuration
#+AUTHOR: Brice Waegeneire
#+OPTIONS: toc:4 h:4

* About this file
Inspired by [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha's configuration]] organisation.
** init.el
{% raw %}
The =init.el= file is needed to bootstrap my actual configuration of
Emacs (ie: =bricewge.org=).
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;;  This file is needed to bootstrap the Emacs' configuration.

  ;;; Interface
  ; Turn off the mouse interface early to avoid momentary displaying it
  (when (fboundp 'menu-bar-mode) (menu-bar-mode -1))
  (when (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (when (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))


  ;;; Package management
  ;;;; ELPA
  (require 'package)
  ;; List of elpa repository
  (setq package-archives '(("ELPA" . "http://tromey.com/elpa/")
                           ("gnu" . "https://elpa.gnu.org/packages/")
                           ("marmalade" . "https://marmalade-repo.org/packages/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("melpa-stable" . "https://stable.melpa.org/packages/")
                           ("org" . "http://orgmode.org/elpa/")))
  (package-initialize)
  (setq package-enable-at-startup nil)

  ;;;; use-package
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-when-compile
    (require 'use-package))
  (require 'diminish)
  (require 'bind-key)

  ;;;; Quelpa
  ; [[https://github.com/quelpa/quelpa][Quelpa]] is usefull when a
  ; package is not yet in MELPA or need a patch. It can be build from source and installed with =package.el= seamlessly.
  (use-package quelpa
    :ensure t
    :init
    (setq quelpa-update-melpa-p nil))

  ; Enable the use of Quelpa with use-package.
  (use-package quelpa-use-package
    :ensure t
    :config
    (quelpa-use-package-activate-advice))

  ;;; org-mode
  (use-package org
    :ensure org-plus-contrib
    :pin org)

  ;;; org-babel
  ; The actual configuration in a literate programming style
  (org-babel-load-file (expand-file-name "bricewge.org" user-emacs-directory))
#+END_SRC

** Dependencies
This configuration file assume that you are using Emacs 24 or higer.
Dependencies needed :
- python¿2?-virtualenv, for jedi
- Meslo LG S, font
- git, for quelpa recepies
- languagetool, for langtool
- ledger, for ledger
- enchant, for wcheck-mode
- hunspell-fr et hunspell-en, dictionnaries for wcheck-mode
- aspell-fr et aspell-en, dictionnaries for wcheck-mode
- mu, for email
- graphicsmagick, for taking screnshot with org-download
- git-wip (https://github.com/itsjeyd/git-wip), for git-wip-timemachine
- wmctrl, for fullscreen
** Personal information
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Brice Waegeneire"
      user-mail-address "brice.wge@gmail.com")
#+END_SRC

* Appearence
** Startup
Use the bookmark buffer as my startup buffer.
#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook 'bookmark-bmenu-list)
  (setq initial-buffer-choice (lambda () (get-buffer "*Bookmark List*")))
  (setq inhibit-startup-message t)
#+END_SRC

Hide the GNU advertisment in the modline and the hints header of scratch buffer .
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-echo-area-message "bricewge")
  (setq initial-scratch-message nil)
#+END_SRC

** Themes
*** Solarized
Use a decent theme.

I only want to use fixed fonts no matter what. Without it collum
allignement is not working anymore because all the characters doesn't
have the same width. Fix the underline position of Meslo for
solarized-theme
#+BEGIN_SRC emacs-lisp
  (use-package solarized-theme
    :ensure t
    :config
    (setq solarized-use-variable-pitch nil)
    (setq x-underline-at-descent-line t))

  (load-theme 'solarized-dark t)
#+END_SRC

** Fonts
Use ~Meslo~ font as standalone and client.

As emacs seems to give a fuck about
=~/.config/fontconfig/conf.d/10-powerline-symbols.conf= I have to add
PowerlineSymbols by hand "Private Use Area" U+E000 - U+F8FF
#+BEGIN_SRC emacs-lisp
  (set-default-font "Meslo LG S 12")
  (add-to-list 'default-frame-alist '(font . "Meslo LG S 12")) ;; For emacsclient
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (setq my-fonts '("Meslo LG S 12"))
  ;; (create-fontset-from-fontset-spec standard-fontset-spec) ;to make --daemon work
  ;; (dolist (font (reverse my-fonts))
  ;;   (set-fontset-font "fontset-standard" 'unicode font nil 'prepend))
  ;; (add-to-list 'default-frame-alist '(font . "fontset-standard"))

  (set-fontset-font "fontset-standard"
                                  (cons (decode-char 'ucs #xE000)
                                        (decode-char 'ucs #xF8FF))
                                  "PowerLineSymbols")
  ;; (set-face-font 'default "fontset-standard")
  ;; (add-hook 'server-switch-hook (set-face-font 'default "fontset-standard"))
#+END_SRC
** misc
#+BEGIN_SRC emacs-lisp
  ;; Non-bliking cusrsor
  (blink-cursor-mode -1)
  (setq-default cursor-type 'bar)

  ;; More smooth scrolling
  (setq mouse-wheel-scroll-amount '(0.01))

  ;; Enable "^" on mac keybord
  (load-library "iso-transl")

  ;; Enable fullscren with F11
  ;; Need wmctrl to be installed
  (defun switch-full-screen ()
    (interactive)
    (shell-command "wmctrl -r :ACTIVE: -btoggle,fullscreen"))
  (global-set-key [f11] 'switch-full-screen)

#+END_SRC
** modline
#+BEGIN_SRC emacs-lisp
  ;; Show colum number in the modeline
  (setq column-number-mode t)
#+END_SRC
*** smart-modline
#+BEGIN_SRC emacs-lisp
  (use-package smart-mode-line
    :ensure t
    :config
    (sml/setup))
#+END_SRC

*** battery
Show the battery in the modline
#+BEGIN_SRC emacs-lisp
  (setq display-battery-mode t)
#+END_SRC
** sublimity						      :old:
Give Emacs a little bit of the Sublime style by centering the buffer
when there are egnouth space.
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package sublimity
    :ensure t
    :config
    (require 'sublimity-attractive)
    (sublimity-mode 1)
    (setq sublimity-attractive-centering-width 110))
#+END_SRC

When using =sublimity= if you want to still let Emacs automaticaly
spliting windows verticaly, =split-width-threshold= should be >= to
=sublimity-attractive-centering-widt=. Otherwise it'll always be split
horizontaly because the width of the window will never be large enougth.
#+BEGIN_SRC emacs-lisp
  (setq split-width-threshold 145)
#+END_SRC
** Bell
Disabel the annoying beep sound and the visual-bell once and for all.
#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
#+END_SRC
* Emacs general
** auth-source
#+BEGIN_SRC emacs-lisp
  (require 'auth-source)
  (setq auth-sources '("~/.authinfo.gpg"))
#+END_SRC
** system
Use french translation for time.
#+BEGIN_SRC emacs-lisp
  (setq system-time-locale "fr_FR.UTF-8")
#+END_SRC

** savehist
Set up a directory for putting all the files which save some kind of
history of the actions done in Emacs.
#+BEGIN_SRC emacs-lisp
  (setq bricewge/emacs-history-directory
        (expand-file-name "history/" user-emacs-directory))
  (unless (file-exists-p bricewge/emacs-history-directory)
    (make-directory bricewge/emacs-history-directory t))
#+END_SRC

Save the history of the minibuffer.
#+BEGIN_SRC emacs-lisp
  (setq savehist-file (expand-file-name "savehist" bricewge/emacs-history-directory))
  (savehist-mode 1)
#+END_SRC
** Backups
Create a directory to put saves of files edited with Emacs.
#+BEGIN_SRC emacs-lisp
  (unless (file-exists-p (expand-file-name "save/" user-emacs-directory))
    (make-directory (expand-file-name "save/" user-emacs-directory)))
#+END_SRC

Don't put backups all over the filesystem but within =~/.emacs.d=. Use sane options for backup
#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist
        `((".*" . ,(expand-file-name "save/" user-emacs-directory))))

  (setq make-backup-files t               ; backup of a file the first time it is saved.
        backup-by-copying t               ; don't clobber symlinks
        version-control t                 ; version numbers for backup files
        delete-old-versions t             ; delete excess backup files silently
        delete-by-moving-to-trash t
        kept-old-versions 6               ; oldest versions to keep when a new numbered backup is made (default: 2)
        kept-new-versions 9)              ; newest versions to keep when a new numbered backup is made (default: 2))
#+END_SRC

** Auto-save
Don't litter the filesystem with =#foo.bar#= files everywhere, put
them in the saved files directory.
#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist
        `((".*" . ,(expand-file-name "save/" user-emacs-directory))))

  (setq auto-save-default t               ; auto-save every buffer that visits a file
        auto-save-timeout 20              ; number of seconds idle time before auto-save (default: 30)
        auto-save-interval 200)           ; number of keystrokes between auto-saves (default: 300)
#+END_SRC

** Custom-file
Save customization in an other file Load the custom file at the
begginig, in that way it can be overwritten by this config file.
I got this snippet from [[https://github.com/purcell/emacs.d/blob/3d78c86d0edf205d062426d1cc8ecb06bc0a4f18/init.el#L125][purcell/emacs.d]].
#+BEGIN_SRC emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+END_SRC

** Question
Shorctut all responses to "yes or no" questions to "y" and "n".
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
* Custom functions and variables

* Org-Mode
*** General
Org-Mode is installed and loaded in =init.el=.
**** Modules
Instead of doing =(require 'org-foo)= all over the place try to use
org-module instead.
#+BEGIN_SRC emacs-lisp
  (setq org-modules '(org-habit
                      org-protocol
                      org-bibtex
                      org-crypt
                      ;; Modules not built-in
                      org-drill
                      org-bullets))
#+END_SRC
**** Appearance
#+BEGIN_SRC emacs-lisp
  ;; Use fancy UTF-8 bullets for the headings.
  (add-hook 'org-mode-hook 'org-bullets-mode)

  ;; Soft wrapped line at word boundary.
  (add-hook 'org-mode-hook 'visual-line-mode)

  ;; Display entities as UTF-8 characters.
  (setq org-pretty-entities t)

  ;; Show decent width image at startup.
  (setq org-image-actual-width '(600))
  (setq org-startup-with-inline-images t)

  ;(setq org-startup-with-latex-preview t)

  ; Set tags not to far from the headline because the font size reduce the space
  ; availaible
  (setq org-tags-column -67)

  ; Replace the "..." of folded headings by something more fancy
  (setq org-ellipsis "⤵")
#+END_SRC
**** Misc
#+BEGIN_SRC emacs-lisp
(setq org-drill-scope 'file) ; Other value: directory

;; Standard key bindings
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)

(setq org-directory "~/org")

;; Does not set a indentation level when moving heading
(setq org-adapt-indentation nil)
#+END_SRC

**** org-crypt
Encrypt org-mode
#+BEGIN_SRC emacs-lisp
  ;; Encrypt all entries before saving
  (eval-after-load 'org-crypt
    '(org-crypt-use-before-save-magic))
  (setq org-tags-exclude-from-inheritance (quote ("crypt")))
  ; GPG key to use for encryption: brice.wge@gmail.com
  (setq org-crypt-key "116F0F99")
#+END_SRC

**** org-entities
Add specials symbols.
#+BEGIN_SRC emacs-lisp
(setq org-entities-user '(
;			  ("space" "\\ " nil " " " " " " " ")
			  ("male" "\\male " t "&#9794" "[male symbol]" "[male symbol]" "♂")
			  ("female" "\\female " t "&#9792" "[female symbol]" "[female symbol]" "♀")
			  ("ohm" "\\ohm " t "&&Omega" "[Omega]" "[Omega]" "Ω")
			  ))
#+END_SRC
*** MobileOrg
#+BEGIN_SRC emacs-lisp
(setq org-mobile-directory "~/ownCloud")
;(setq org-mobile-files "~/org")
(setq org-mobile-inbox-for-pull "~/ownCloud/mobileorg.org")
#+END_SRC
*** Exporting
**** General
#+BEGIN_SRC emacs-lisp
  ;; Add exporter
  (setq org-export-backends '(ascii
                              latex
                              md
                              odt
                              ; Not part of Emacs
                              koma-letter
                              ))
#+END_SRC

Utility needed to export to html in some edge-cases.
#+BEGIN_SRC emacs-lisp
  (use-package htmlize
    :ensure t)
#+END_SRC
**** XeLaTeX
May need some tweaking, see here http://kieranhealy.org/esk/kjhealy.html#sec-1-5-5.
***** Word processor
#+BEGIN_SRC emacs-lisp
(setq org-latex-pdf-process
      '("xelatex -interaction nonstopmode -output-directory %o %f"
	"biber %b"
        "xelatex -interaction nonstopmode -output-directory %o %f"
        "xelatex -interaction nonstopmode -output-directory %o %f"))
#+END_SRC
***** Packages
List of TEX packages used by default.

#+BEGIN_SRC emacs-lisp
  (setq org-latex-default-packages-alist
        '(
          ("" "fontspec" t)
          ("" "polyglossia" t)
          ;; ("AUTO" "inputenc" t)
          ;; ("T1" "fontenc" t)
          ("" "fixltx2e" nil)
          ("" "graphicx" t)
          ("" "longtable" nil)
          ("" "float" nil)
          ("" "wrapfig" nil)
          ("" "rotating" nil)
          ("normalem" "ulem" t)
          ("" "amsmath" t)
          ("" "textcomp" t)
          ("" "marvosym" t)
          ("" "wasysym" t)
          ("" "amssymb" t)
          ("" "capt-of" nil)
          ("" "hyperref" nil)
          ("" "unicode-math" t) ;; Need to be after all math packages
          "\\tolerance=1000"
          "\\setdefaultlanguage{french}")
        )
#+END_SRC

List of packages for latex, used in:
- latex fragments
- compte-rendu
#+BEGIN_SRC emacs-lisp
  (setq org-latex-packages-alist
        '(("" "chemfig" t)
          ))
#+END_SRC

